In [1]:

import pandas as pd
import numpy as np

import pymysql     
from sqlalchemy import create_engine 

from getpass import getpass

In [2]:
password = getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [4]:
# 1. How many distinct (different) actors' last names are there?

data = pd.read_sql_query("SELECT COUNT(DISTINCT last_name) AS distinct_last_name \
FROM sakila.actor;", engine)
data

   distinct_last_name
0                 121

In [5]:

# 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.
data1 = pd.read_sql_query("SELECT *, \
CASE WHEN DAYNAME(rental_date) IN ('Saturday', 'Sunday') THEN 'Weekend'\
ELSE 'Weekday' END AS day_type \
FROM rental;", engine)
data1.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,Weekday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,Weekday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,Weekday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,Weekday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,Weekday

In [6]:
# 3. Get all films with ARMAGEDDON in the title.
data2 = pd.read_sql_query("SELECT title \
FROM film \
WHERE title LIKE ('%%ARMAGEDDON%%');", engine)
data2

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

In [7]:

# 4. Get 10 the longest films.
data3 = pd.read_sql_query("SELECT title, length \
FROM film \
ORDER BY length DESC \
LIMIT 10; \
", engine)
data3

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

In [8]:

# 5. How many films include Behind the Scenes content?
data4 = pd.read_sql_query("SELECT COUNT(*) AS behind_the_scenes_count \
FROM film \
WHERE special_features LIKE '%%Behind the Scenes%%';", engine)
data4.head()

   behind_the_scenes_count
0                      538

In [9]:

# 6.  Which kind of movies (rating) have a mean duration of more than two hours?
data5 = pd.read_sql_query(" SELECT rating, ROUND(AVG(length),2) AS avg_per_rating \
FROM film \
GROUP BY rating HAVING AVG(length) > 120 ;", engine)
data5

  rating  avg_per_rating
0  PG-13          120.44

In [13]:
# 7.  Rank films by length (filter out the rows that have nulls or 0s in length column). 
# In your output, only select the columns title, length, and the rank.



# Select title, length
# from film
# where length != 0 and length is not null
# order by length desc;

SyntaxError: invalid syntax (1171273323.py, line 9)